Public Attributes | List of all members
API_RVMChange Struct Reference
Revision Management
Represents a revision change. More...
#include <APIdefs_Database.h>
 Public Attributes
GS::UniString  | id
Unique ID of the Change.
GS::UniString  | description
Short description of the Change.
GSTime  | lastModifiedTime
Last modified time of the Change.
GS::UniString  | modifiedByUser
Teamwork user identifier (full name) who last modified the Change.
bool  | issued
Change in a document revision is in an issue or not.
bool  | archived
Change is archived or active.
GS::HashTable< API_Guid, GS::UniString >  | customData
Contains the custom data fields. The custom scheme GUID-value pairs are stored in a GS::HashTable.
Detailed Description
Represents a revision change.
Remarks
You are able to get all changes via ACAPI_Revision_GetRVMChanges function, and get the custom scheme of changes via ACAPI_Revision_GetRVMChangeCustomScheme function.
Member Data Documentation
◆ archived
 API_RVMChange::archived
Change is archived or active.
◆ customData
 API_RVMChange::customData
Contains the custom data fields. The custom scheme GUID-value pairs are stored in a GS::HashTable.
◆ description
 API_RVMChange::description
Short description of the Change.
◆ id
 API_RVMChange::id
Unique ID of the Change.
◆ issued
 API_RVMChange::issued
Change in a document revision is in an issue or not.
◆ lastModifiedTime
 API_RVMChange::lastModifiedTime
Last modified time of the Change.
◆ modifiedByUser
 API_RVMChange::modifiedByUser
Teamwork user identifier (full name) who last modified the Change.